**** 宣言の展開
#+name: declaration-lazy_segment_tree-var
#+begin_src bash :exports code :var val_base="integer" val_kind="int32" :results output :noweb no-export :cache no :shebang #!/bin/bash
  <<lazy_segment_tree-var>>
  cat <<EOF
  <<declaration-lazy_segment_tree>>
  EOF
#+end_src

#+RESULTS: declaration-lazy_segment_tree-var
#+begin_example
integer
public ::
public ::
type ::
   private
   integer(int32) :: num_elems_, arr_size_, tree_size_, depth_, idx_range_left_, idx_range_right_
   , allocatable :: arr_(:), lazy_(:)
   logical, allocatable :: is_lazy_(:)
   class(), allocatable :: monoid_
 contains
   procedure, pass :: init_
   procedure, pass :: init_by_arr_
   generic :: init => &
        init_, &
        init_by_arr_
   procedure, pass :: dump => &
        dump_
   procedure, pass :: unsafe_set => &
        unsafe_set_
   procedure, pass :: unsafe_bottomup_update => &
        unsafe_bottomup_update_
   procedure, pass :: strict_propagate_all => &
        strict_propagate_all_
   procedure, pass, private :: strict_propagate_all_sub => &
        strict_propagate_all_sub_
   procedure, pass :: update => &
        update_
   procedure, pass, private :: update_sub => &
        update_sub_
   procedure, pass :: query => &
        query_
   procedure, pass, private :: eval_and_propagate => &
        eval_and_propagate_
end type
type, abstract ::
   private
 contains
   procedure(identity_int32) , nopass, deferred :: identity
   procedure(bin_op_int32)   , nopass, deferred :: bin_op
   procedure(mapping_int32)  , nopass, deferred :: mapping
   procedure(composite_int32), nopass, deferred :: composite
end type
abstract interface
   pure  function identity_int32() result(res)

   end function identity_int32
   pure  function bin_op_int32(x, y) result(res)

     , intent(in) :: x, y
   end function bin_op_int32
   pure  function mapping_int32(v, c, length) result(res)

     , intent(in) :: v, c
     integer(4), intent(in) :: length
   end function mapping_int32
   pure  function composite_int32(c_first, c_second) result(res)

     , intent(in) :: c_first, c_second
   end function composite_int32
end interface
#+end_example

#+name: procedures-lazy_segment_tree-var
#+begin_src bash :exports code :var val_base="integer" val_kind="int32" :results output :noweb no-export :cache no :shebang #!/bin/bash
  <<lazy_segment_tree-var>>
  cat <<EOF
  <<procedures-lazy_segment_tree>>
  EOF
#+end_src
